humidor-server/app/controllers/humid_controller.rb

  def getCurrent
    puts Tempdata.order('created_at').last
---
SELECT "tempdata".* FROM "tempdata" ORDER BY created_at DESC LIMIT 1